#!/usr/bin/env awk

BEGIN{FS="/"} {
    printf "Рейс: " $1 ",";
    if (($3-$2) > 0){
        if (($3-$2) > max){
            max = ($3-$2)
        }
        if (($3-$2) < min){
            min = ($3-$2)
        } 
        print " время полета: " $3-$2
    } else{
         if ((24-$2 + $3) > max){
            max = (24-$2 + $3)

        }
        if ((24-$2 + $3) < min){
            min = (24-$2 + $3)
        }
        print " время полета: " 24-$2 + $3
    }  
}
END{
    print " ";

    print "максимальная длительность полета: "max;
    printf "минимальная длительность полета: "min;
}
