#!/bin/bash
while [ 1=1 ]
do
	echo -e "1-вывод файла с конца\n2-восьмиричный вывод файла\n3-tar архивация \n4-сжатие файла\n5-первые  10 файлов\n6-проверка  контрольной суммы\n7-райзмер файла в байтах\n8-поиск файлов\n9-вставка по горизонтали\n10-вывод свободного места\n11-создать файл\n12-редактирование файла\n13-текущая директория" 
	read -p "вв-те номер команды: " number
	if [[ 1 = "$number" ]] ; then 
	    read -p "имя файла: " file 
	    tail $file
	    echo "---------------------------------------------"
	elif [[ 2 = "$number" ]] ; then 
	    read -p "имя файла: " file
	    od  $file
	    echo "---------------------------------------------"
	elif [[ 3 = "$number" ]] ; then 
	    read -p "имя файла: " file
		tar $file
	    echo "---------------------------------------------"
	elif [[ 4 = "$number" ]] ; then 
	  	read -p "имя файла: " file
		tar $file
	    echo "---------------------------------------------"
	 
	elif [[ 5 = "$number" ]] ; then 
	    read -p "имя файла: " file 
	    head $file  
	    echo "---------------------------------------------"
	elif [[ 6 = "$number" ]] ; then 
	    read -p "имя файла: " file
	    md5 $file
	    echo "---------------------------------------------"
	elif [[ 7 = "$number" ]] ; then 
	    read -p "имя файла: " file
	    du $file
	    echo "---------------------------------------------"
	elif [[ 8 = "$number" ]] ; then 
	    read -p "имя файла: " file
	    find $file
	    echo "---------------------------------------------"

	elif [[ 9 = "$number" ]] ; then 
	    read -p "имя файла: " file1
	    read -p "имя файла: " file2
		paste $file1 $file2
	    rm  $file
	    echo "---------------------------------------------"
	elif [[ 11 = "$number" ]] ; then 
		read -p "имя файла: " file
		touch $file
	    echo "---------------------------------------------"
	elif [[ 10 = "$number" ]] ; then 
	    df 
	    echo "---------------------------------------------"
	elif [[ 12 = "$number" ]] ; then 
		read -p "имя файла: " file
		vim $file
	    echo "---------------------------------------------"
	elif [[ 13 = "$number" ]] ; then 
	    pwd
	    echo "---------------------------------------------"
	else
		echo "нет команды"
		echo "---------------------------------------------"
fi
done

